Repository: msdx/gradle-translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Chapter 26. The War Plugin
zh_cn: 第二十六章. War 插件

source: Chapter 27. The Ear Plugin
zh_cn: 第二十七章. Ear 插件

source: Chapter 28. The Jetty Plugin
zh_cn: 第二十八章. Jetty 插件

source: Chapter 29. The Checkstyle Plugin
zh_cn: 第二十九章. Checkstyle 插件

source: Chapter 3. Tutorials
zh_cn: 第三章. 教程说明

source: Chapter 30. The CodeNarc Plugin
zh_cn: 第三十章. CodeNarc 插件

source: Chapter 31. The FindBugs Plugin
zh_cn: 第三十一章. FindBugs 插件

source: Chapter 32. The JDepend Plugin
zh_cn: 第三十二章. JDepend 插件

source: Chapter 33. The PMD Plugin
zh_cn: 第三十三章. PMD 插件

source: Chapter 34. The JaCoCo Plugin
zh_cn: 第三十四章. JaCoCo 插件

source: Chapter 35. The Sonar Plugin
zh_cn: 第三十五章. Sonar 插件

source: Chapter 36. The Sonar Runner Plugin
zh_cn: 第三十六章. Sonar Runner 插件

source: Chapter 37. The OSGi Plugin
zh_cn: 第三十七章. OSGi 插件

source: Chapter 38. The Eclipse Plugin
zh_cn: 第三十八章. Eclipse 插件

source: Chapter 39. The IDEA Plugin
zh_cn: 第三十九章. IDEA 插件

source: Chapter 40. The ANTLR Plugin
zh_cn: 第四十章. ANTLR 插件

source: Chapter 41. The Project Report Plugin
zh_cn: 第四十一章. 项目报告插件

source: Chapter 42. The Announce Plugin
zh_cn: 第四十二章. Announce插件

source: Chapter 43. The Build Announcements Plugin
zh_cn: 第四十三章. 构建公告插件

source: Chapter 44. The Distribution Plugin
zh_cn: 第四十四章. 分发插件

source: Chapter 45. The Application Plugin
zh_cn: 第四十五章. 应用程序插件

source: Chapter 46. The Java Library Distribution Plugin
zh_cn: 第46章. Java 库发布插件

source: Chapter 47. Build Init Plugin
zh_cn: 第四十七章. Build Init 插件

source: Chapter 48. Wrapper Plugin
zh_cn: 第四十八章. Wrapper 插件

source: Chapter 49. The Build Dashboard Plugin
zh_cn: 第四十九章. Build Dashboard 插件

source: Chapter 5. Troubleshooting
zh_cn: 第 5 章. 疑难解答

source: Chapter 50. Dependency Management
zh_cn: 第五十章. 依赖管理

source: Chapter 51. Publishing artifacts
zh_cn: 第五十一章. 发布构件

source: Chapter 52. The Maven Plugin
zh_cn: 第五十二章. Maven 插件

source: Chapter 53. The Signing Plugin
zh_cn: 第五十三章. 签名插件

source: Chapter 54. Building native binaries
zh_cn: 第54章. 构建原生二进制文件

source: Chapter 55. The Build Lifecycle
zh_cn: 第55章. 构建的生命周期

source: Chapter 56. Multi-project Builds
zh_cn: 第五十六章. 多项目构建

source: Chapter 57. Writing Custom Task Classes
zh_cn: 第五十七章. 编写自定义任务类

source: Chapter 58. Writing Custom Plugins
zh_cn: 第五十八章. 编写自定义插件

source: Chapter 59. Organizing Build Logic
zh_cn: 第五十九章. 组件构建逻辑

source: Chapter 62. Embedding Gradle
zh_cn: 第六十二章. 嵌入 Gradle

source: Chapter 63. Comparing Builds
zh_cn: 第六十三章. 比较构建

source: Chapter 7. Java Quickstart
zh_cn: 第 7 章. Java 快速入门

source: Chapter 8. Dependency Management Basics
zh_cn: Chapter 8. 依赖管理基础

source: Chapter 9. Groovy Quickstart
zh_cn: 第九章. Groovy快速入门

source: Checkstyle configuration file
zh_cn: Checkstyle 配置文件

source: Choosing a log level
zh_cn: 选择一个日志级别

source: Class or a super class contain a method annotated with @Test
zh_cn: 类或超类含有一个带@Test注解的方法

source: Class or a super class extends TestCase or GroovyTestCase
zh_cn: 类或超类继承自TestCase或GroovyTestCase

source: Class or a super class is annotated with @RunWith
zh_cn: 类或超类使用了@RunWith进行注解

source: Client module dependencies allow to declare transitive dependencies directly in the build script.
zh_cn: 客户端模块依赖允许直接在构建脚本中声明传递依赖。

source: Client module dependency
zh_cn: 客户端模块依赖

source: CodeNarc configuration file
zh_cn: CodeNarc 配置文件

source: Command Line
zh_cn: 命令行

source: Command line option "--tests" is provided to conveniently set the test filter.
zh_cn: 提供了“--tests”的命令行选项，以方便地设置测试过滤器。

source: Common values can be set from a parent build script.
zh_cn: 共同的值可以在父构建脚本中进行设置。

source: Compared to using the standalone Sonar Runner, the Sonar Runner plugin offers the following benefits:
zh_cn: 相比单独使用 Sonar Runner，Sonar Runner 插件提供了以下便利：

source: Compile time dependencies
zh_cn: 编译时依赖

source: Compile time dependencies for the given source set
zh_cn: 给定源集的编译时依赖

source: Compiles production Groovy source files.
zh_cn: 编译production 的 Groovy 源文件。

source: Compiles production Java source files using javac.
zh_cn: 使用 javac 编译产品中的 Java 源文件。

source: Compiles production Scala source files.
zh_cn: 编译production 的 Scala 源文件。

source: Compiles test Groovy source files.
zh_cn: 编译test 的 Groovy 的源文件。

source: Compiles test Java source files using javac.
zh_cn: 使用 javac 编译 Java 的测试源文件。

source: Compiles test Scala source files.
zh_cn: 编译test 的 Scala 的源文件。

source: Compiles the given source set's Groovy source files.
zh_cn: 编译给定的source set 里的 Groovy 源文件。

source: Compiles the given source set's Java source files using javac.
zh_cn: 使用 javac 编译给定的源集中的 Java 源文件。

source: Compiles the given source set's Scala source files.
zh_cn: 编译给定的source set 里的 Scala 源文件。

source: Compiling in external process
zh_cn: 在外部进程中编译

source: Complete overwrite works equally well for individual files, for example by executing gradle cleanEclipseClasspath eclipseClasspath.
zh_cn: 完全覆盖同样可以用于个人文件，例如通过执行gradle cleanEclipseClasspath eclipseClasspath。

source: Complete overwrite works equally well for individual files, for example by executing gradle cleanIdeaModule ideaModule.
zh_cn: 完整覆盖同样可以用于个人文件，例如通过执行gradle cleanIdeaModule ideaModule。

source: Component Type
zh_cn: 组件类型

source: Configuration
zh_cn: 配置

source: Configuration Properties
zh_cn: 配置属性

source: Configuration dependencies are between projects whereas execution dependencies are always resolved to task dependencies.
zh_cn: 配置依赖是项目之间的，而执行依赖总是被解析为任务依赖。

source: Configuration dependencies are very different to execution dependencies.
zh_cn: 配置依赖与执行依赖有很大上的不同。

source: Configuration injection feature and access to the complete project model are possible because every project is configured before the execution phase.
zh_cn: 由于每个项目都在执行阶段之前配置，所以也能做到配置注入功能以及访问整个项目模型。

source: Configuration of projects in parallel.
zh_cn: 并行的项目配置。

source: Configuration on demand mode attempts to configure only projects that are relevant for requested tasks.
zh_cn: 按需配置模式尝试只配置所请求的任务相关的项目。

source: Configuration shared between subprojects can be configured in a subprojects block.
zh_cn: 在subprojects块中，可以配置共享子项目之间的配置。

source: Configuration time of huge multi-project builds may become noticeable.
zh_cn: 对于巨大的项目，这个配置时间就会变得非常可观。

source: Configurations have a name, a number of other properties, and they can extend each other.
zh_cn: 配置有一个名字和许多属性，并且它们能够互相继承。

source: Configure by DAG
zh_cn: 使用 DAG 配置

source: Configured a main source set with default (i.e. conventional) values for properties
zh_cn: 通过属性的默认（即常规）配置了 main 源码集

source: Configured supporting tasks to use these properties to perform work
zh_cn: 配置支持使用这些属性来执行工作的任务

source: Configuring a first level dependency as forced.
zh_cn: 强制配置第一级依赖。

source: Configuring an HTTP proxy (for example for downloading dependencies) is done via standard JVM system properties.
zh_cn: 配置 HTTP 代理服务器 （例如用于下载依赖） 是通过标准的 JVM 系统属性来做的。

source: Configuring any dependency (transitive or not) as forced.
zh_cn: 强制配置任何依赖项（不管是否可传递）。

source: Configuring arbitrary objects
zh_cn: 配置任意对象

source: Configuring arbitrary objects using an external script
zh_cn: 使用外部脚本配置任意对象

source: Configuring tasks
zh_cn: 配置任务

source: Configuring the build environment via gradle.properties
zh_cn: 通过 gradle.properties 配置构建环境

source: Configuring the daemon
zh_cn: 配置守护进程

source: Configuring the project using an external build script
zh_cn: 使用外部构建脚本配置项目

source: Conflicting versions of the same jar should be detected and either resolved or cause an exception.
zh_cn: 相同的 jar 包的冲突版本应该被检测到，并且要么解决，要么抛出异常。

source: Consider the Gradle project itself, while Gradle only has a few direct, first-level dependencies, when Gradle is compiled it needs more that one hundred dependencies on the classpath.
zh_cn: 考虑 Gradle 项目本身，虽然 Gradle 仅有几个直接的第一级依赖，当 编译 Gradle 时在它的类路径上会需要超过一百个的依赖。

source: Consider the case where another task is to consume the classes files.
zh_cn: 考虑一下另一种消费类文件的任务的情况。

source: Contains a sample class and unit test, if there are no existing source or test files
zh_cn: 如果不存在源文件或测试文件，会包含一个示例类和单元测试

source: Contains a sample groovy class and an according Spock specification, if there are no existing source or test files
zh_cn: 如果不存在源文件或测试文件，会包含一个示例 groovy 类和一个相应的 Spock 规范

source: Contains a sample scala class and an according ScalaTest test suite, if there are no existing source or test files
zh_cn: 如果不存在源文件或测试文件，会包含一个示例 scala 类和一个相应的 ScalaTest 测试套件

source: Contains all .g found in the ANTLR source directories, and excludes all other types of files.
zh_cn: 包含在 ANTLR 源目录中找到的所有的.g，并排除所有其他类型的文件。

source: Contains all .groovy and .java files found in the Groovy source directories, and excludes all other types of files.
zh_cn: 包含在 Groovy 源目录中找到的所有的.groovy和.java文件，并排除所有其他类型的文件。

source: Contains all .scala and .java files found in the Scala source directories, and excludes all other types of files.
zh_cn: 包含在 Scala 源目录中找到的所有的.scala和.java文件，并排除所有其他类型的文件。

source: Contains only .java files found in the Java source directories, and excludes all other files.
zh_cn: 仅包含Java源文件目录里的.java文件，并排除其他所有文件。

source: Contains only resources, and excludes any .java files found in the resource source directories.
zh_cn: 仅包含资源文件，并且排除在资源源目录中找到的所有 .java 文件。

source: Contains only the .groovy files found in the Groovy source directories.
zh_cn: 包含在 Groovy 源目录中找到的所有的.groovy文件。

source: Contains only the .scala files found in the Scala source directories.
zh_cn: 包含在 Scala 源目录中找到的所有的.scala文件。

source: Contains the artifacts and dependencies required by this project at runtime.
zh_cn: 包含本项目运行时所需要的构件和依赖。

source: Contains the project's source sets.
zh_cn: 包含项目的源集。

source: Content assistance in the IDE
zh_cn: 在 IDE 中的内容帮助

source: Continuing the build when a failure occurs
zh_cn: 失败后继续执行

source: Convention properties
zh_cn: 约定属性

source: Conventions
zh_cn: 约定

source: Conversely, Gradle's direct compiler integration (see above) will reuse the same compiler process as much as possible.
zh_cn: 相反，Gradle 的直接编译器集成 （见上文） 将尽可能多地重用相同的编译器进程。

source: Copies of this document may be made for your own use and for distribution to others, provided that you do not charge any fee for such copies and further provided that each copy contains this Copyright Notice, whether distributed in print or electronically.
zh_cn: 本文件的副本，无论其分发是以印刷版本还是电子版本，也无论是您自用，还是分发给他人，均为免费形式，并且每一份副本均需带有版权声明。

source: Copies production resources into the production classes directory.
zh_cn: 把生产资源文件拷贝到生产的类目录中。

source: Copies test resources into the test classes directory.
zh_cn: 把测试的资源文件拷贝到测试的类目录中。

source: Copies the given source set's resources into the classes directory.
zh_cn: 把给定的源集的资源文件拷贝到类目录中。

source: Copy specs form a hierarchy.
zh_cn: 复制规范用来组织一个层次结构。

source: Copying files
zh_cn: 复制文件

source: Copyright © 2007-2012 Hans Dockter, Adam Murdoch
zh_cn: 版权所有 © 2007-2012 Hans Dockter, Adam Murdoch

source: Creates OS specific scripts to run the project as a JVM application.
zh_cn: 创建操作系统特定的脚本来把该项目作为一个 JVM 应用程序运行。

source: Creates a TAR archive of the distribution contents
zh_cn: 创建分发内容的 TAR 文件

source: Creates a ZIP archive of the distribution contents
zh_cn: 创建分发内容的 ZIP 文件

source: Creates a full distribution TAR archive including runtime libraries and OS specific scripts.
zh_cn: 创建包含了运行时库和操作系统特定的脚本的完整分发 TAR 文件。

source: Creates a full distribution ZIP archive including runtime libraries and OS specific scripts.
zh_cn: 创建包含了运行时库和操作系统特定的脚本的完整分发 ZIP 文件。

source: Creates a full distribution ZIP archive including runtime libraries.
zh_cn: 创建包含运行时库的完整分发 ZIP 文件。

source: Creating archives
zh_cn: 创建归档文件

source: Creation of advanced dependency reports tailored to your use case.
zh_cn: 创建高级的依赖报告，以适应你的用例。

source: Cross-compiling is possible with the Gcc and Clang tool chains, by programmatically adding support for additional target platforms.
zh_cn: 使用 Gcc 和 Clang 工具链，通过 以编程方式添加附加的目标平台的支持，是可以做到交叉编译的。

source: Current Directory
zh_cn: 当前目录

source: Customizing
zh_cn: 自定义

source: DEBUG and higher (that is, all log messages)
zh_cn: DEBUG 及更高

source: Debug messages
zh_cn: 调试消息

source: Declaring variables
zh_cn: 声明变量

source: Declaring your dependencies
zh_cn: 依赖声明

source: Decoupled projects may only interact in terms of declared dependencies: project dependencies (Section 50.4.3, “Project dependencies”) and/or task dependencies (Section 6.5, “Task dependencies”).
zh_cn: 解耦的项目可能只在声明依赖方面会互相影响：项目依赖（第 50.4.3节, “项目依赖”）， 或者是任务依赖（第 6.5节, “任务依赖”）。

source: Default Value
zh_cn: 默认值

source: Default tasks
zh_cn: 默认任务

source: Default value
zh_cn: 默认值

source: Defines the root directory of your Gradle project (typically where build.gradle is located).
zh_cn: 定义了你的 Gradle 项目（通常是 build.gradle 所在的位置）的根目录。

source: Defining tasks
zh_cn: 定义任务

source: Deletes the output files produced by the specified task.
zh_cn: 删除由指定的任务所产生的输出文件。

source: Deletes the project build directory.
zh_cn: 删除项目的build目录。

source: Dependencies for C++ projects are binary libraries that export header files.
zh_cn: C++ 项目的依赖是导出头文件的二进制库。

source: Dependency Management Basics
zh_cn: 依赖管理基础

source: Dependency configurations
zh_cn: 依赖配置

source: Dependency management
zh_cn: 依赖管理

source: Dependency management can be particularly challenging during a migration from one build system to another.
zh_cn: 依赖管理在从一个构建系统迁移到另一个的过程中尤其具有挑战性。

source: Dependency management is a critical feature of every build, and Gradle has placed an emphasis on offering first-class dependency management that is both easy-to-understand and compatible with a wide variety of approaches.
zh_cn: 依赖管理是每个构建的关键特性，并且 Gradle 强调提供最好的依赖管理，容易理解以及使用各种各样的方法来兼容。

source: Dependency resolution will fail if the required artifacts are not available in any repository specified by the build, regardless whether the local cache has retrieved this artifact from a different repository.
zh_cn: 如果所需的构件，在构建所指定的任何仓库中都没有找到的话，依赖解析将会失败，无论本地缓存是否从一个其他的仓库中取回这个构件。

source: Dependency resolve rules are an incubating feature introduced in Gradle 1.4 which give you fine-grained control over the version selected for a particular dependency.
zh_cn: 依赖解析规则是一个在 Gradle 1.4 引进的孵化中的功能，让你可以对特定的依赖细粒度地控制所选定的版本。

source: Dependency resolve rules give you the power to enforce releasable units in your build.
zh_cn: 依赖解析规则使你能够在构建中强制指定可发布的单位。

source: Dependency resolve rules provide a mechanism for blacklisting a particular version of a dependency and providing a replacement version.
zh_cn: 依赖解析规则提供了一个机制，用于把一个依赖的指定版本列入黑名单，并提供一个替代的版本。

source: Dependency resolve rules provide a neat implementation of this pattern:
zh_cn: 依赖解析规则提供了这种模式的整洁的实现：

source: Dependency resolve rules provide a very powerful way to control the dependency resolution process, and can be used to implement all sorts of advanced patterns in dependency management.
zh_cn: 依赖解析规则提供了一种非常强大的方式来控制依赖解析过程，并可以用于实现在依赖管理中各种高级模式的排序。

source: Depending on project size, the Sonar Runner may require a lot of memory.
zh_cn: 根据项目大小，Sonar Runner 可能需要大量的内存。

source: Depending on the test framework used (JUnit / TestNG) the test class detection uses different criteria.
zh_cn: 根据所使用的测试框架 （JUnit 或 TestNG），会使用不同的标准进行测试类的检测。

source: Depends on
zh_cn: 依赖于

source: Depends on the archive type, and for TAR files, the compression type as well: zip, jar, war, tar, tgz or tbz2.
zh_cn: 依赖于归档的类型，用于TAR文件，可以是以下压缩类型： zip, jar, war, tar, tgz or tbz2.

source: Depends on the archive type.
zh_cn: 依赖于归档类型。

source: Deploying to a Maven repository is only half the fun if you don't have a POM. Fortunately Gradle can generate this POM for you using the dependency information it has.
zh_cn: 如果你没有一个POM文件，部署到 Maven 仓库只有一半的乐趣。幸运的是 Gradle 可以使用它的依赖信息为你生成这个 POM。

source: Deploys your web application to a Jetty web container embedded in the build.
zh_cn: 在构建中部署你的web程序到一个内嵌的Jetty web容器中。

source: Description
zh_cn: 描述

source: Despite this wide variation of requirements, the Gradle project recommends that all projects follow this set of core rules:
zh_cn: 尽管这一要求变化很大，Gradle 项目建议所有项目都遵循这套核心规则：

source: Details about the Gradle Wrapper can be found in the according chapter Chapter 61, The Gradle Wrapper
zh_cn: 可以根据第六十一章， Gradle Wrapper这一章的内容中获取有关 Gradle Wrapper 的详细信息

source: Did we mention faster builds?
zh_cn: 我们提到了更快的构建吗？

source: Different configurations can be mapped to one or different scopes.
zh_cn: 不同的configurations可以映射到一个或不同的scopes。

source: Directory
zh_cn: 目录

source: Directory creation
zh_cn: 创建目录

source: Distribution archives typically contain then executable application and other supporting files, such as documentation.
zh_cn: 分发 archives 通常包含可执行程序，和其他支持文件，比如文档。

source: Does not add any particular source sets.
zh_cn: 不会添加任何特定的源集。

source: Does not support any meta-data formats.
zh_cn: 不支持任何元数据格式。

source: Does the same as the eclipse plugin plus generates eclipse WTP (Web Tools Platform) configuration files.
zh_cn: 与 eclipse 插件一样，但它还生成 eclipse WTP （Web 工具平台） 的配置文件。

source: Don't forget that your build script is simply Groovy code that drives the Gradle API.
zh_cn: 不要忘记您的构建脚本是简单的 Groovy 代码，并驱动着 Gradle API。

source: Double clicking a task executes it.
zh_cn: 双击一个任务可以执行它。

source: Download
zh_cn: 下载

source: Dry Run
zh_cn: 模拟运行

source: Due to the overhead of dependency analysis, a clean compilation or a compilation after a larger code change may take longer than with the Ant based compiler.
zh_cn: 由于依赖分析的系统开销，一次干净的编译或在代码有了较大的更改之后的编译，可能花费的时间要长于使用基于 Ant 的编译器。

source: Due to this mechanism, your CUnit sources may not contain a main method since this will clash with the method provided by Gradle.
zh_cn: 由于这一机制，你的 CUnit 源碼可能不包含一个main方法，因为这会与 Gradle 所提供的方法产生冲突。

source: During the initialization phase, Gradle determines which projects are going to take part in the build, and creates a Project instance for each of these projects.
zh_cn: 在初始化阶段，Gradle 确定哪些项目是需要构建的，并为每个需要构建的项目创建一个Project实例。

source: During this phase the project objects are configured.
zh_cn: 在这一阶段，对project对象进行配置。

source: Dynamic configuration from Gradle build scripts
zh_cn: 通过 Gradle 构建脚本动态配置

source: Dynamic tasks
zh_cn: 动态任务

source: Each artifact or ivy specified for a repository adds an additional pattern to use.
zh_cn: 每个artifact或ivy都指定了一个仓库，添加一个额外的的模式来使用。

source: Each library component can produce at least one SharedLibraryBinary and at least one StaticLibraryBinary.
zh_cn: 每个library组件可以产生至少一个SharedLibraryBinary和至少一个StaticLibraryBinary。

source: Each added TargetPlatformConfiguration defines support for a particular target platform, and supplies additional tool arguments that are required to target this platform.
zh_cn: 每个添加的 TargetPlatformConfiguration 定义了对一个特定的目标平台的支持，并且提供了针对该平台所需要的额外的工具参数。

source: Each artifact can have a different set of dependencies.
zh_cn: 每个 artifact 可以有一组不同的依赖。

source: Each binary is associated with a particular ToolChain, allowing settings to be targeted based on this value.
zh_cn: 每个二进制文件与特定的ToolChain关联，允许设置基于此值进行针对性的配置。

source: Each binary to be produced is associated with a set of compiler and linker settings, which include command-line arguments as well as macro definitions.
zh_cn: 每一个产生的二进制文件都和一系列的编译器和链接器设置相关联，这些设置包含了命令行参数，以及宏定义。

source: Each closure has a delegate object, which Groovy uses to look up variable and method references which are not local variables or parameters of the closure.
zh_cn: 每个闭包都有一个委托对象，Groovy 使用它来查找变量和方法的引用，而不是作为闭包的局部变量或参数。

source: Each component can have a set of named flavors, and a separate binary variant can be produced for each flavor.
zh_cn: 每个组件都可以有一组flavors，并且能为每一个flavor生成一个单独的二进制变种。

source: Each element in the tree represents a project.
zh_cn: 树中的每个元素表示一个项目。

source: Each filter has a POM associated with it which you can configure.
zh_cn: 每个过滤器都有一个你可以进行配置的POM与它关联。

source: Each jar or war object has a manifest property with a separate instance of Manifest.
zh_cn: 每个 jar 或war 对象都有一个单独的Manifest实例的manifest属性。

source: Each module (also called component) has metadata associated with it, such as its group, name, version, dependencies, and so on.
zh_cn: 每个模块（也称为组件）都有相关的元数据上，像它的组，名称，版本，依赖，等等。

source: Each native binary produced for a component is referred to as variant.
zh_cn: 组件所产生的每个原生二进制称为variant。

source: Each of these functional source sets will contain a language-specific source set for each of the languages supported by the project.
zh_cn: 这些功能源码集将为project所支持的每一种语言包含指定语言的源码集。

source: Each project in the hierarchy has its own project configuration.
zh_cn: 层次结构中的每个项目都有其自身的项目配置。

source: Each project object has by default a name equals to the name of its top level directory.
zh_cn: 每个project 对象都有和其顶层目录名称一样的默认名称。

source: Each repository can have its own layout.
zh_cn: 每个仓库都可以有其自己的布局。

source: Each repository is inspected in order, searching first for a module descriptor file (POM or Ivy file) that indicates the presence of that module.
zh_cn: 每个仓库按顺序进行检查，首先查找指示该模块存在的模块描述符文件（POM 或 Ivy 文件）。

source: Each task has an inputs and outputs property, which you use to declare the inputs and outputs of the task.
zh_cn: 每个任务都有一个inputs和outputs的属性，用来声明任务的输入和输出。

source: Each test process executes only a single test at a time, so you generally don't need to do anything special to your tests to take advantage of this.
zh_cn: 每个测试进程会依次执行一个单一的测试，所以你一般不需要对你的测试做任何的配置来利用这一点。

source: Each time after that, before the task is executed, Gradle takes a new snapshot of the inputs and outputs.
zh_cn: 之后每一次，在执行任务之前，Gradle 会对输入和输出进行一次新的快照。

source: Each tool chain implementation allows for a certain degree of configuration (see the API documentation for more details).
zh_cn: 每个工具链的实现都允许一定程度的配置（更多细节请参阅API文档）

source: Eager to try out this new feature?
zh_cn: 想尝试这一新功能？

source: Ear resources, such as a META-INF directory
zh_cn: Ear 资源，如 META-INF 目录

source: Eclipse Integration
zh_cn: Eclipse 集成

source: Edit the build.gradle file.
zh_cn: 编辑 build.gradle 文件。

source: Editing the filter allows you to configure which tasks and projects are shown.
zh_cn: 通过编辑过滤器，你可以对哪些任务和项目要显示进行配置。

source: Element
zh_cn: 元素

source: Enables new incubating mode that makes Gradle selective when configuring projects.
zh_cn: 启用新的孵化模式，可以在配置项目时使得 Gradle 具有选择性。

source: Enabling the build logic to make decisions based on the content of the dependency graph.
zh_cn: 启用使构建逻辑基于依赖树的内容来决定。

source: Enabling this option hides any output when a task is executed unless the build fails.
zh_cn: 启用此选项将在任务执行时隐藏任何输出，除非构建失败。

source: Enforce sequential ordering of tasks: eg.
zh_cn: 强制任务顺序执行： 如，

source: Enter the daemon
zh_cn: 走进守护进程

source: Entries in the properties map can be read and written with the usual Groovy syntax.
zh_cn: 在properties map的条目可以使用常见的 Groovy 语法来读取和写入。

source: Environment variables
zh_cn: 环境变量

source: Error messages
zh_cn: 错误消息

source: Especially useful for the classic 'single test method execution' use case.
zh_cn: 这对“单一测试方法的执行”的经典用例特别有用。

source: Even faster builds: preemptively evaluate projects, so that the model is ready when the user next invokes Gradle.
zh_cn: 更快的构建： 预评估项目，这样当用户接下来调用 Gradle 时，模型就准备好了。

source: Even if your project is using a custom dependency management system or something like an Eclipse .classpath file as master data for dependency management, it is very easy to write a Gradle plugin to use this data in Gradle.
zh_cn: 即使你的项目使用一个自定义的依赖管理系统，或者是一些像 Eclipse 作为依赖管理的主数据的 .classpath 文件，那么可以很容易地写一个 Gradle 插件在 Gradle 中使用此数据。

source: Even more, this declarative language is extensible.
zh_cn: 并且，这种声明性的语言是可以扩展的。

source: Eventually, most configuration is passed to the Sonar code analyzer in the form of key-value pairs known as Sonar properties.
zh_cn: 最终，大多数配置都会以被称为 Sonar 属性的键-值对的形式传递给 Sonar 的代码分析器。

source: Every entry in the metadata cache includes a record of the repository that provided the information as well as a timestamp that can be used for cache expiry.
zh_cn: 每个元数据缓存中的条目包括了一条存储库中提供的信息，以及可用于缓存到期的时间戳的记录。

source: Every parallel worker exclusively owns a given project while executing a task.
zh_cn: 当执行一个任务时，每一个并行的worker都仅拥有一个给定的项目。

source: Every project except the root project has a parent project and might have child projects.
zh_cn: 除了根 project，每个project有一个父project，并且可能还有子projects。
